
#include <iostream>
#include <clocale>
#include <typeinfo>




//1. Написать программу, вычисляющую выражение a * (b + (c /d)) и выводящую результат с плавающей точкой, где a, b, c, d
//– целочисленные константы.Используйте static_cast или СStyle cast к float чтобы выполнить точное деление.
// 4. ** Написать программу, вычисляющую выражение из первого задания, а переменные для неё объявлены и инициализировать в другом cpp файле.Используйте extern.

using namespace std;

extern const int a;

extern const int b;

extern const int c;

extern const int d;

float n;

//2. Дано целое число. Если оно меньше или равно 21, то выведите на экран разницу между этим числом и числом 21.
//Если же заданное число больше, чем 21, необходимо вывести удвоенную разницу между этим числом и 21. При выполнении задания следует использовать тернарный оператор(? : ).

int number;

float answer;

//3. задание

int *ptr;




int main()
{
    setlocale(LC_ALL, "Russian");


    ///////////////////////////////////////////////Первое задание и четвертое задание//////////////////////////////
    //почему то неправильно считается если сразу считать все выражение
    //g = static_cast<float> (a) * (b + (c / d));

    n = static_cast<float> (c) / d;

    n += static_cast<float> (b);

    n *= static_cast<float> (a);

    cout << "1 Задание. Ответ: " << n << endl;

    // вывел для себя, чтобы проверить
    cout << typeid(n).name() << endl;

    //////////////////////////////////////////////////////////////////////////////////////////////////////////////



    ///////////////////////////////////////////////Второе задание/////////////////////////////////////////////////

    cout << "Введите число" << endl;

    cin >> number;

    answer = (number <= 21) ? static_cast<float> (number) - 21 : static_cast<float> ((number)-21) * 2;

    cout << "2 Задание. Ответ: " << answer << endl;

    //////////////////////////////////////////////////////////////////////////////////////////////////////////////



    ///////////////////////////////////////////////Третье задание/////////////////////////////////////////////////

    //3. * Описать трёхмерный целочисленный массив, размером 3х3х3 и указатель на значения внутри массива и при помощи операции разыменования вывести на экран значение
    //центральной ячейки получившегося куба[1][1][1].

   /*
    int Array[3][3][3], *ptr;

    ptr = *Array[3];

    *ptr = 1;

    ptr ++;
    
    *ptr = 1;

    ptr++;

    *ptr = 1;

    cout << Array[2] << Array[3] << Array[4];
    */

    return 0;
}

